/*
KANJI[][] = new Array("","","","","",
				  "","","","","",
				  "","","","","",
				  "","","","","");

YOMI[][] = new Array("","","","","",
				  "","","","","",
				  "","","","","",
				  "","","","","");
*/

var KANJI = new Array();
KANJI[0] = new Array();
KANJI[1] = new Array();
KANJI[2] = new Array();
KANJI[3] = new Array();

var YOMI = new Array();
YOMI[0] = new Array();
YOMI[1] = new Array();
YOMI[2] = new Array();
YOMI[3] = new Array();

var QUESTION_STR = new Array();
QUESTION_STR[0] = new Array ();
QUESTION_STR[1] = new Array ();
QUESTION_STR[2] = new Array ();
QUESTION_STR[3] = new Array ();

// Q1

QUESTION_STR[0][0] = '<h4 style="padding:20px">[一] 次の虫を表す漢字を<u>平仮名で</u>答えなさい。（3点×10問）</h4>';

KANJI[0][0] = new Array("蚰蜒","竜蝨","蠹魚","飛蛩",
				  "竹節虫","歩行虫","蛭","鳳蝶","蝸牛被",
				  "蚋","蜈蚣","螽","水爬虫","吊虻",
				  "蟾蜍","蝌蚪","蠹","胡蜂",
				  "金鐘児","瓢虫","埋葬虫","隠翅虫");

YOMI[0][0] = new Array("げじげじ:げじ","げんごろう","しみ","たまむし","いなご",
				  "ななふし","おさむし：ごみむし","ひる","あげはちょう","まいまいかぶり",
				  "ぶゆ:ぶよ","むかで","やぶか","いなご","たがめ","つりあぶ",
				  "ひきがえる","おたまじゃくし","きくいむし:しみ","すずめばち",
				  "すずむし","てんとうむし","しでむし","はねかくし");

QUESTION_STR[0][1] = '<h4 style="padding:20px">[一] 次の魚介類を表す漢字を<u>平仮名で</u>答えなさい。（3点×10問）</h4>';

KANJI[0][1] = new Array("青蝦","青竜蝦","章魚","蚌","老海鼠",
				  "梭尾螺","蟶貝","鯯","鯢","魹",
				  "鯧","鱷","銀口魚","琵琶魚","鱏",
				  "王余魚","鼠頭魚","三文魚","馬鮫魚","鬼頭魚",
				  "犁頭魚","松江魚","魚虎","金鎗魚","丁斑魚",
				  "霊螺子","硴","十脚","海燕");

YOMI[0][1] = new Array("しばえび","しゃこ","たこ","はまぐり","ほや",
				  "ほらがい","まてがい","このしろ","さんしょううお","とど",
				  "まながつお","わに","あゆ","あんこう","えい",
				  "かれい","きす","さけ","さわら","しいら",
				  "しゅもくざめ","すずき","はりせんぼん","まぐろ","めだか",
				  "うに","かき","さくらえび","たこのまくら");

// Q2

QUESTION_STR[1][0] = '<h4 style="padding:20px">[二] 次の漢字を<u>訓読みで(送り仮名も含めて)</u>答えなさい。（3点×10問）</h4>';

KANJI[1][0] = new Array("嗇か","咫い","尸る","厶る","曩に",
				  "殯","爨ぐ","纛","罕に","羸れる","麤しい",
				  "肆","徊う","讒う","贅な","齲","纜",
				  "絮","亟","孼い","壎","丐","蝟",
				  "仍に","犢","冤","誄","誣る",
				  "蘞い","醢汁","扈る","遑しい","闃か",
				  "丕きい","倪","囹","售る","庠",
				  "翹てる","聿い","熙ぶ","齦","糴",
				  "齬う","糵","笨な","皁い","黜ける",
				  "麑");

YOMI[1][0] = new Array("やぶさか","ちかい:みじかい","つかさどる","ござる","さきに",
				  "かりもがり","かしぐ","はたぼこ","まれに","つかれる","あらあらしい",
				  "ほしいまま","さまよう","へつらう","よけいな","むしば","ともづな",
				  "わたいれ:わた","しばしば","わざわい","つちぶえ","こじき","はりねずみ",
				  "しきりに","こうし","ぬれぎぬ:あだ","しのびごと:いのりごと","そしる",
				  "えぐい","しょっつる","はびこる","あわただしい","しずか",
				  "おおきい","ながしめ:きわ","ひとや","うる","まなびや",
				  "つまだてる","すばやい","よろこぶ","はぐき","かいよね:いりよね",
				  "くいちがう","もやし:こうじ","そまつな","くろい","しりぞける",
				  "かのこ");

// Q3

QUESTION_STR[2][0] = '<h4 style="padding:20px">[三] 次の熟語の読みを<u>音読みで</u>答えなさい。（3点×10問）</h4>';

KANJI[2][0] = new Array("俊乂","俾倪","兌換","狂飆","聚斂",
				  "咫尺","暗翳","萎靡","街衢","雲鬟","船檣",
				  "撫恤","瀛海","倏忽","闃寂","戯謔",
				  "砌下","糴糶","縹緲","大纛","羸瘦","抃躍",
				  "耋艾","垢膩","褫奪","検覈","朶頤","謹飭",
				  "覬覦","贏輸","汨没","愧赧","誄文","囲繞",
				  "醯醢","韜略","餒虎","縉紳",
				  "飫聞","髫齔","鹵莽","耿然","匕鬯",
				  "壎篪","熙笑","麤鹵","龕灯","鎖鑰");

YOMI[2][0] = new Array("しゅんがい","へいげい","だかん","きょうひょう","しゅうれん",
				  "しせき","どんよう","あんえい","いび","がいく","うんかん","せんしょう",
				  "ぶじゅつ","えいかい","しゅっこつ","げきせき","ぎぎゃく",
				  "せいか","ちょうてき","ひょうびょう","だいとう","るいそう","べんやく",
				  "てつがい","こうじ","ちだつ","けんかく","だい","きんちょく",
				  "きゆ","えいゆ:えいしゅ","こつぼつ","きたん","るいぶん","いじょう：いにょう",
				  "けいかい","とうりゃく","だいこ","しんしん",
				  "よぶん","ちょうしん","ろもう","こうぜん","ひちょう",
				  "けんち","きしょう","そろ","がんとう","さやく");

// Q4

QUESTION_STR[3][0] = '<h4 style="padding:20px">[一] 次の国名を表す漢字を<u>カタカナで</u>答えなさい。（2点×5問）</h4>';

KANJI[3][0] = new Array("愛斯蘭","愛蘭","亜弗掩担","阿爾及","亜爾然丁",
				  "英吉利","伊色剌","烏克蘭","宇柳具","埃及",
				  "濠太剌利","墺太利","和蘭","加奈陀","幾肉亜",
				  "玖馬","希臘","哥倫比亜","牙買加","新嘉坡",
				  "瑞西","瑞典","蘇丹","西班牙","泰",
				  "智利","丁抹","独逸","土耳古","新西蘭",
				  "泥婆羅","諾威","巴羅貝","洪牙利","比律賓",
				  "芬蘭","伯剌西爾","仏蘭西","勃牙利","越南",
				  "部屋重良","秘露","白耳義","波蘭","葡萄牙",
				  "羅馬尼亜","墨西哥","露西亜","墓利比亜","莫臥児");

YOMI[3][0] = new Array("アイスランド","アイルランド","アフガニスタン","アルジェリア","アルゼンチン",
				  "イギリス","イスラエル","ウクライナ","ウルグアイ","エジプト",
				  "オーストラリア","オーストリア","オランダ","カナダ","ギニア",
				  "キューバ","ギリシャ","コロンビア","ジャマイカ","シンガポール",
				  "スイス","スウェーデン","スーダン","スペイン","タイ",
				  "チリ","デンマーク","ドイツ","トルコ","ニュージーランド",
				  "ネパール","ノルウェー","パラグアイ","ハンガリー","フィリピン",
				  "フィンランド","ブラジル","フランス","ブルガリア","ベトナム",
				  "ベネズエラ","ペルー","ベルギー","ポーランド","ポルトガル",
				  "ルーマニア","メキシコ","ロシア","ボリビア","モンゴル");