/*

DATA[][] = new Array(
	["", ""],
	["", ""],
	["", ""],
	["", ""],
	["", ""],
	["", ""],
	["", ""],
	["", ""],
	["", ""],
	["", ""],
	0.0, // 受検者
	0.0  // 合格者
);

*/

let DATA = new Array(); // 出題漢字,正解

// 多次元配列の生成
for (let i=15; i<=30; i++) {
	DATA[i] = new Array();
}

// DATA[平成○○年][第〇回]

DATA[19][1] = new Array(
	["石決明", "あわび"],
	["柳葉魚", "ししゃも"],
	["海驢", "あしか"],
	["木天蓼", "またたび"],
	["映日果", "いちじく"],
	["天牛", "かみきりむし,かみきり"],
	["朱欒", "ザボン"],
	["螻蛄", "けら,おけら"],
	["哨吶", "チャルメラ,チャルメル"],
	["泛子", "うき"],
	0.0, // 受検者
	0.0  // 合格者
);

DATA[20][1] = new Array(
	["行器", "ほかい"],
	["信天翁", "あほうどり"],
	["善知鳥", "うとう"],
	["大口魚", "たら"],
	["浮塵子", "うんか"],
	["海参", "いりこ"],
	["香蕈", "しいたけ"],
	["熨斗", "のし"],
	["皁莢", "さいかち"],
	["覆盆子", "いちご"],
	0.0, // 受検者
	8.5  // 合格者
);

DATA[20][2] = new Array(
	["金雀児", "エニシダ"],
	["馬酔木", "あせび,あしび"],
	["牛膝", "いのこずち"],
	["小火", "ぼや"],
	["瓊脂", "ところてん"],
	["型録", "カタログ"],
	["只管", "ひたすら"],
	["秧鶏", "くいな"],
	["翻車魚", "まんぼう(ざめ),うき(ぎ)"],
	["箶籙", "やなぐい"],
	0.0, // 受検者
	8.8  // 合格者
);

DATA[20][3] = new Array(
	["四阿", "あずまや"],
	["飛白", "かすり"],
	["鬼灯", "ほおずき"],
	["水雲", "もずく"],
	["肌理", "きめ"],
	["檸檬", "レモン"],
	["鶏魚", "いさき"],
	["沙蚕", "ごかい"],
	["拳螺", "さざえ"],
	["九面芋", "やつがしら"],
	0.0, // 受検者
	0.0  // 合格者
);

DATA[21][1] = new Array(
	["吃逆", "しゃっくり"],
	["馬尾藻", "ほんだわら"],
	["豪猪", "やまあらし"],
	["直衣", "のうし"],
	["海鞘", "ほや"],
	["蜚蠊", "ごきぶり,あぶらむし"],
	["青竜蝦", "しゃこ"],
	["金糸雀", "カナリア"],
	["紅娘", "てんとうむし"],
	["縹緻", "きりょう"],
	0.0, // 受検者
	8.0  // 合格者
);

DATA[21][2] = new Array(
	["告天子", "ひばり"],
	["水爬虫", "たがめ"],
	["樹懶", "なまけもの"],
	["連枷", "からさお,からざお"],
	["海鷂魚", "えい"],
	["花楸樹", "ななかまど"],
	["海扇", "ほたてがい"],
	["木乃伊", "ミイラ"],
	["天牛", "かみきりむし,かみきり"],
	["甘蕉", "バナナ"],
	0.0, // 受検者
	8.2  // 合格者
);

DATA[21][3] = new Array(
	["鷦鷯", "みそさざい"],
	["蟀谷", "こめかみ"],
	["繁縷", "はこべ,はこべら"],
	["牛尾魚", "こち"],
	["白地", "あからさま"],
	["山毛欅", "ぶな"],
	["鹿尾菜", "ひじき"],
	["踏鞴", "たたら"],
	["細魚", "さより"],
	["虎杖", "いたどり"],
	0.0, // 受検者
	0.0  // 合格者
);

DATA[22][1] = new Array(
	["驀地", "まっしぐら"],
	["魚狗", "かわせみ"],
	["裲襠", "うちかけ"],
	["醬蝦", "あみ"],
	["玫瑰", "はまなす,はまなし"],
	["風信子", "ヒヤシンス"],
	["狗母魚", "えそ"],
	["三和土", "たたき"],
	["二合半", "こなから"],
	["赤楝蛇", "やまかがし"],
	0.0, // 受検者
	0.0  // 合格者
);

DATA[22][2] = new Array(
	["軍鶏", "しゃも"],
	["大口魚", "たら"],
	["海参", "いりこ"],
	["山茶", "つばき"],
	["仮漆", "ニス,ワニス"],
	["鳳尾松", "そてつ"],
	["蚯蚓", "みみず"],
	["百舌", "もず"],
	["胡籙", "やなぐい"],
	["大角豆", "ささげ,ささぎ"],
	0.0, // 受検者
	0.0  // 合格者
);

DATA[22][3] = new Array(
	["糸葱", "あさつき"],
	["秧鶏", "くいな"],
	["豪猪", "やまあらし"],
	["鬼頭魚", "しいら"],
	["蝦蛄", "しゃこ"],
	["瓢虫", "てんとうむし"],
	["珠鶏", "ほろほろちょう"],
	["掏摸", "すり"],
	["高襟", "ハイカラ"],
	["狼煙", "のろし"],
	0.0, // 受検者
	0.0  // 合格者
);

DATA[23][1] = new Array(
	["鳶尾", "いちはつ"],
	["公魚", "わかさぎ"],
	["吃逆", "しゃっくり"],
	["飛白", "かすり"],
	["蛤仔", "あさり"],
	["繡眼児", "めじろ"],
	["耶悉茗", "ジャスミン"],
	["馬酔木", "あせび,あしび"],
	["竜蝨", "げんごろう"],
	["海蘿", "ふのり"],
	0.0, // 受検者
	9.0  // 合格者
);

DATA[23][2] = new Array(
	["車前草", "おおばこ"],
	["羊駝", "ラマ"],
	["泛子", "うき"],
	["嘉魚", "いわな"],
	["水雲", "もずく"],
	["紙魚", "しみ"],
	["蛇舅母", "かなへび"],
	["縹緻", "きりょう"],
	["小火", "ぼや"],
	["怪鴟", "よたか"],
	0.0, // 受検者
	8.0  // 合格者
);

DATA[23][3] = new Array(
	["柳葉魚", "ししゃも"],
	["皁莢", "さいかち"],
	["天蚕糸", "てぐす"],
	["朱鷺", "とき"],
	["氷下魚", "こまい"],
	["煙管", "キセル"],
	["雨久花", "みずあおい"],
	["水手", "かこ"],
	["飯匙倩", "はぶ"],
	["生絹", "すずし"],
	0.0, // 受検者
	0.0  // 合格者
);

DATA[24][1] = new Array(
	["直衣", "のうし"],
	["胼胝", "たこ"],
	["馴鹿", "トナカイ"],
	["鳳梨", "パイナップル"],
	["交喙", "いすか"],
	["馬尾藻", "ほんだわら"],
	["玉筋魚", "いかなご"],
	["胡孫眼", "さるのこしかけ"],
	["梅花皮", "かいらぎ"],
	["草石蚕", "ちょろぎ"],
	0.0, // 受検者
	0.0  // 合格者
);

DATA[24][2] = new Array(
	["豪猪", "やまあらし"],
	["蜚蠊", "ごきぶり,あぶらむし"],
	["日照雨", "そばえ"],
	["褞袍", "どてら"],
	["百日紅", "さるすべり"],
	["鴨脚樹", "いちょう"],
	["牛膝", "いのこずち"],
	["葦雀", "よしきり"],
	["鶏魚", "いさき"],
	["儒艮", "ジュゴン"],
	0.0, // 受検者
	0.0  // 合格者
);

DATA[24][3] = new Array(
	["覆盆子", "いちご"],
	["蕃瓜樹", "パパイア"],
	["二号半", "こなから"],
	["蝦虎魚", "はぜ"],
	["冬眠鼠", "やまね"],
	["浅葱", "あさつき"],
	["天牛", "かみきりむし,かみきり"],
	["紅絹", "もみ"],
	["杜宇", "ほととぎす"],
	["狼煙", "のろし"],
	0.0, // 受検者
	7.8  // 合格者
);

DATA[25][1] = new Array(
	["石竜子", "とかげ"],
	["山毛欅", "ぶな"],
	["蝦蛄", "しゃこ"],
	["文身", "いれずみ"],
	["珠鶏", "ほろほろちょう"],
	["金翅雀", "ひわ"],
	["牛尾魚", "こち"],
	["滷汁", "にがり"],
	["馬陸", "やすで"],
	["熨斗", "のし"],
	0.0, // 受検者
	0.0  // 合格者
);

DATA[25][2] = new Array(
	["蚊母鳥", "よたか"],
	["狗母魚", "えそ"],
	["鳶尾", "いちはつ"],
	["鬼頭魚", "しいら"],
	["天糸瓜", "へちま"],
	["蕃椒", "とうがらし"],
	["生絹", "すずし"],
	["水蠆", "やご"],
	["水手", "かこ"],
	["厚皮香", "もっこく"],
	0.0, // 受検者
	0.0  // 合格者
);

DATA[25][3] = new Array(
	["草烏頭", "とりかぶと"],
	["木賊", "とくさ"],
	["鉄葉", "ブリキ"],
	["蟀谷", "こめかみ"],
	["蚯蚓", "みみず"],
	["竹麦魚", "ほうぼう"],
	["虎耳草", "ゆきのした"],
	["梅花皮", "かいらぎ"],
	["老海鼠", "ほや"],
	["金糸雀", "カナリア"],
	0.0, // 受検者
	8.4  // 合格者
);

DATA[26][1] = new Array(
	["鳳尾松", "そてつ"],
	["翻筋斗", "もんどり"],
	["山小菜", "ほたるぶくろ"],
	["告天子", "ひばり"],
	["梭尾螺", "ほらがい"],
	["海蘿", "ふのり"],
	["嘉魚", "いわな"],
	["仮漆", "ニス,ワニス"],
	["海鼠", "なまこ"],
	["連枷", "からさお,からざお"],
	0.0, // 受検者
	0.0  // 合格者
);

DATA[26][2] = new Array(
	["豆娘", "いととんぼ"],
	["馴鹿", "トナカイ"],
	["蜀魂", "ほととぎす"],
	["月代", "さかやき"],
	["型録", "カタログ"],
	["鼓豆虫", "みずすまし"],
	["鴨跖草", "つゆくさ"],
	["望潮", "しおまねき"],
	["天蚕糸", "てぐす"],
	["障泥", "あおり"],
	0.0, // 受検者
	0.0  // 合格者
);

DATA[26][3] = new Array(
	["蘿蔔", "すずしろ"],
	["倍良", "べら"],
	["礬水", "どうさ"],
	["慈姑", "くわい"],
	["行器", "ほかい"],
	["蛇舅母", "かなへび"],
	["金翅雀", "ひわ"],
	["金雀枝", "エニシダ"],
	["三和土", "たたき"],
	["草石蚕", "ちょろぎ"],
	0.0, // 受検者
	0.0  // 合格者
);

DATA[27][1] = new Array(
	["瓊脂", "ところてん"],
	["蝌蚪", "おたまじゃくし"],
	["椿象", "かめむし"],
	["雀鷂", "つみ"],
	["稲架", "はさ,はざ"],
	["玉筋魚", "いかなご"],
	["九面芋", "やつがしら"],
	["風信子", "ヒヤシンス"],
	["山毛欅", "ぶな"],
	["没分暁漢", "わからずや"],
	0.0, // 受検者
	0.0  // 合格者
);

DATA[27][2] = new Array(
	["鉄葉", "ブリキ"],
	["雪洞", "ぼんぼり"],
	["紅絹", "もみ"],
	["鶏魚", "いさき"],
	["珠鶏", "ほろほろちょう"],
	["草烏頭", "とりかぶと"],
	["赤楝蛇", "やまかがし"],
	["青竜蝦", "しゃこ"],
	["金鐘児", "すずむし"],
	["映日果", "いちじく"],
	0.0, // 受検者
	0.0  // 合格者
);

DATA[27][3] = new Array(
	["松魚", "かつお"],
	["洋墨", "インク,インキ"],
	["馬陸", "やすで"],
	["樹懶", "なまけもの"],
	["秧鶏", "くいな"],
	["水爬虫", "たがめ"],
	["鉄刀木", "たがやさん"],
	["側金盞花", "ふくじゅそう"],
	["牛尾魚", "こち"],
	["厚皮香", "もっこく"],
	0.0, // 受検者
	0.0  // 合格者
);

DATA[28][1] = new Array(
	["金襖子", "かじかがえる,かじか"],
	["熬海鼠", "いりこ"],
	["蝦虎魚", "はぜ"],
	["日照雨", "そばえ"],
	["山小菜", "ほたるぶくろ"],
	["羊駝", "ラマ"],
	["杜宇", "ほととぎす"],
	["五加", "うこぎ"],
	["水綿", "あおみどろ"],
	["麺麭", "パン"],
	0.0, // 受検者
	0.0  // 合格者
);

DATA[28][2] = new Array(
	["儒艮", "ジュゴン"],
	["浮塵子", "うんか"],
	["棠棣", "はねず"],
	["胡孫眼", "さるのこしかけ"],
	["望潮", "しおまねき"],
	["家鴨", "あひる"],
	["山茶", "つばき"],
	["白膠木", "ぬるで"],
	["円座", "わろうだ"],
	["海盤車", "ひとで"],
	0.0, // 受検者
	0.0  // 合格者
);

DATA[28][3] = new Array(
	["信天翁", "あほうどり"],
	["海豚", "いるか"],
	["竹麦魚", "ほうぼう"],
	["魚狗", "かわせみ"],
	["後朝", "きぬぎぬ"],
	["糸葱", "あさつき"],
	["雀鷂", "つみ"],
	["乙甲", "めりかり"],
	["高襟", "ハイカラ"],
	["吾木香", "われもこう"],
	0.0, // 受検者
	0.0  // 合格者
);

DATA[29][1] = new Array(
	["箶籙", "やなぐい"],
	["紫薇", "さるすべり"],
	["馴鹿", "トナカイ"],
	["萵苣", "ちさ,ちしゃ"],
	["華盛頓", "ワシントン"],
	["金鐘児", "すずむし"],
	["繡眼児", "めじろ"],
	["馬鮫魚", "さわら"],
	["王余魚", "かれい"],
	["桃花鳥", "とき"],
	5.2, // 受検者
	9.3  // 合格者
);

DATA[29][2] = new Array(
	["馬陸", "やすで"],
	["獺虎", "ラッコ"],
	["嘉魚", "いわな"],
	["金漆", "こしあぶら"],
	["産土", "うぶすな"],
	["鶏児腸", "よめな"],
	["埋葬虫", "しでむし"],
	["白頭鳥", "ひよどり"],
	["以色列", "イスラエル"],
	["自鳴琴", "オルゴール"],
	5.0, // 受検者
	8.6  // 合格者
);

DATA[29][3] = new Array(
	["青花魚", "さば"],
	["聖林", "ハリウッド"],
	["礬水", "どうさ"],
	["石蓴", "あおさ"],
	["酢漿草", "かたばみ"],
	["赤楝蛇", "やまかがし"],
	["羊乳", "つるにんじん"],
	["海松布", "みるめ"],
	["僂麻質斯", "リウマチ"],
	["紙魚", "しみ"],
	4.7, // 受検者
	0.0  // 合格者
);

DATA[30][1] = new Array(
	["蹈鞴", "たたら"],
	["天魚", "あまご"],
	["蜈蚣", "むかで"],
	["抽斗", "ひきだし"],
	["伯剌西爾", "ブラジル"],
	["接骨木", "にわとこ"],
	["五倍子", "ふし"],
	["鴨脚樹", "いちょう"],
	["梅花皮", "かいらぎ"],
	["金翅雀", "ひわ"],
	0.0, // 受検者
	0.0  // 合格者
);

DATA[30][2] = new Array(
	["虎魚", "おこぜ"],
	["二合半", "こなから"],
	["吹螺", "ほらがい"],
	["髻華", "うず"],
	["甘露子", "ちょろぎ"],
	["尸童", "よりまし"],
	["三鞭酒", "シャンパン,シャンペン"],
	["椿象", "かめむし"],
	["蝦虎魚", "はぜ"],
	["白及", "しらん"],
	0.0, // 受検者
	0.0  // 合格者
);
