
let TITLE = "漢字しりとり(仮) - レベル３";
let PAGE_TITLE = "漢字しりとり(仮) レベル３";
let BACKGROUND_URL = "../img/img_siritori.jpg";

let LEVEL = 3;
let NAME = "クロ";
let ATTACK = 30;
let IMAGE_URL = "t.co/xl0fT8n6oI";
let GENRE = "植物・鳥・虫";

let DATA = new Array();

DATA[0] = new Array(
["見風乾", "あかしで"],
["柳葉菜", "あかばな"],
["明衣", "あかは,あかはとり"],
["榔楡", "あきにれ"],
["土常山", "あまちゃ"],
["絞股藍", "あまちゃづる"],
["紫繍鞠", "あじさい"],
["雁翅檜", "あすなろ"],
["紫菜", "あまのり,あさくさのり"],
["大葉藻", "あまも"],
["退紅", "あらぞめ"],
["土荊芥", "ありたそう"],
["野天門", "アスパラガス"],
["豆鼓草", "あやめ"],
["蘆薈", "アロエ"],
["臙脂菜", "あかざ"]
);

DATA[1] = new Array(
["木蓮子", "いたび"],
["赤檮", "いちい"],
["大角草", "いささぐさ"],
["茅膏菜", "いしもちそう"],
["鹿蹄草", "いちやくそう"],
["磚子苗", "いぬくぐ"],
["仙毛欅", "いぬぶな"],
["羅漢松", "いぬまき"],
["蘢", "いぬたで"],
["蚊母樹", "いすのき"],
["仏虚", "いぐさ"],
["蛇眼草", "いわがねそう"],
["常春藤", "いつまでぐさ"],
["石竜牙草", "いしもちそう"],
["千秋", "いわひば"],
["東海美人", "いがい"],
["蹲鴟", "いもがしら"],
["婆婆納", "いぬのふぐり"],
["淫羊藿", "いかりそう"]
);

DATA[2] = new Array(
["虎掌", "うらしまそう"],
["績麻", "うみお,うみそ"],
["楊櫨木", "うつぎ"],
["猪籠草", "うつぼかずら"],
["連枝草", "うまごやし"],
["白梨樹", "うらじろのき"],
["竜葵", "うみほおずき"],
["毛茛", "うまのあしがた"]
);

DATA[3] = new Array(
);

DATA[4] = new Array(
["珍珠菜", "おかとらのお"],
["金沸草", "おぐるま"],
["江籬", "おごのり"],
["紫茉莉", "おしろいばな"],
["小連翹", "おとぎりそう"],
["野芝麻", "おどりこそう"],
["牛筋草", "おひしば"],
["紅樹", "おひるぎ"],
["黄花龍芽", "おみなえし"],
["滴滴金", "おぐるま"],
["蝌蚪", "おたまじゃくし"]
);

DATA[5] = new Array(
["百両金", "からたちばな"],
["杜夫魚", "かくぶつ"],
["金襖子", "かじかがえる"],
["黄鶏", "かしわ"],
["石陰子", "かせ"],
["鳩酸草", "かたばみ"],
["貎佳草", "かきつばた,かおよぐさ"],
["車前葉", "かたくり"],
["加拿林雀", "カナリア"],
["襀翅", "かわせみ"]
);

DATA[6] = new Array(
["九里香", "きんもくせい"],
["金瘡小草", "きらんそう"],
["爵牀", "きつねのまご"],
["仙人帽", "きぬがさたけ"],
["紅南瓜", "きんとうが"],
["泥胡菜", "きつねあざみ"],
["蠹", "きくいむし"]
);

DATA[7] = new Array(
["海州常山", "くさぎ"],
["鼠李", "くろうめもどき"],
["威霊仙", "くがいそう"],
["白屈菜", "くさのおう"],
["黄連花", "くされだま"],
["鼠李", "くろうめもどき"],
["山白竹", "くまざさ"],
["馬鞭草", "くまつづら"],
["山藤", "くまやなぎ"]
);

DATA[8] = new Array(
["荷包牡丹", "けまんそう,けまんぼたん"],
["毳い", "けばい"],
["毯", "けむしろ"],
["槁", "けやき"],
["毛足鵟", "けあしのすり"],
["電纜", "ケーブル"]
);

DATA[9] = new Array(
["麻葉繡毬", "こでまり"],
["金漆", "こしあぶら"],
["金松", "こうやまき"],
["火踏子", "こたつ"],
["蛼", "こおろぎ"]
);

DATA[10] = new Array(
["槐葉蘋", "さんしょうも"],
["南五味子", "さねかずら"],
["狗舌草", "さわおぐるま"],
["三毬杖", "さぎちょう"],
["松蘿", "さるおがせ"],
["怕痒樹", "さるすべり"],
["胡孫眼", "さるのこしかけ"],
["山梗葉", "さわぎきょう"],
["寿光木", "さわぐるみ"],
["弱檜", "さわら"]
);

DATA[11] = new Array(
["鴉葱", "しらいとそう"],
["東風菜", "しらやまぎく"],
["君遷子", "しなのがき"],
["笑靨花", "しじみばな"],
["吐綬鶏", "しちめんちょう"],
["天社蛾", "しゃちほこが"],
["挙尾虫", "しりあげむし"],
["半風子", "しらみ"],
["蠖", "しゃくとりむし"]
);

DATA[12] = new Array(
["問荊", "すぎな"],
["燉煌瓜", "すいか"],
["一夜草", "すみれ"]
);

DATA[13] = new Array(
["石蜐", "せ"],
["鬼鍼草", "せんだんぐさ"],
["剪秋羅", "せんのう"],
["嫁学鳥", "せきれい"]
);

DATA[14] = new Array(
["雀卵斑", "そばかす"],
["鳳尾松", "そてつ"],
["鉄蕉", "そてつ"]
);

DATA[15] = new Array(
["洋玉蘭", "たいさんぼく"],
["栄蘭", "たこのき"],
["水豆児", "たぬきも"],
["淡把菰", "たばこ"],
["相思草", "たばこ"]
);

DATA[16] = new Array(
["石胡萎", "ちどめぐさ"],
["玉環菜", "ちょろぎ"],
["狼尾草", "ちからしば"],
["水甘草", "ちょうじそう"],
["天青地白", "ちちこぐさ"]
);

DATA[17] = new Array(
["落葵", "つるむらさき"],
["黄麻", "つなそ"],
["江浦草", "つくも"],
["山珊瑚", "つちあけび"],
["蛇菰", "つちとりもち"],
["地胆", "つちはんみょう"],
["映山紅", "つつじ"],
["光桃", "つばいもも"],
["鴾毛", "つきげ"],
["鷸子", "つぶり"],
["何首烏", "つるどくだみ"],
["鳥馬", "つぐみ"]
);

DATA[18] = new Array(
["桃金嬢", "てんにんか"],
["草蝦", "てながえび"],
["石花菜", "てんぐさ"]
);

DATA[19] = new Array(
["水鼈", "とちかがみ"],
["沢漆", "とうだいぐさ"],
["三角楓", "とうかえで"],
["金線蛙", "とのさまがえる"],
["野老", "ところ"],
["一日花", "とろろあおい"],
["蝘蜓", "とかげ"]
);

DATA[20] = new Array(
["烏臼", "なんきんはぜ"],
["野菰", "なんばんぎせる"],
["蜀椒", "なるはじかみ"],
["続断", "なべな"],
["黄精", "なるこゆり"],
["土肉", "なまこ"],
["螗", "なつぜみ"]
);

DATA[21] = new Array(
["郁李", "にわうめ"],
["蟪蛄", "にいにいぜみ"],
["蝸", "にな,にし"]
);

DATA[22] = new Array(
);

DATA[23] = new Array(
["菟糸", "ねなしかずら"],
["女貞", "ねずみもち"],
["交枝樹", "ねむのき"]
);

DATA[24] = new Array(
["土当帰", "のだけ"],
["和尚菜", "のぶき"]
);

DATA[25] = new Array(
["紫参", "はるとらのお"],
["刺楸", "はりぎり"],
["蛇牀", "はまぜり"],
["爆米", "はぜ"],
["瓶爾小草", "はなやすり"],
["玉鈴花", "はくうんぼく"],
["六月雪", "はくちょうげ"],
["虎茄", "はしりどころ"],
["黄櫨", "はぜ,はぜのき,はじ"],
["知母", "はなすげ"],
["牛縻", "はなづら"],
["鼠麴草", "ははこぐさ"],
["蔓荊", "はまごう"],
["黄槿", "はまぼう"],
["文珠蘭", "はまゆう"],
["馬銜", "はみ"],
["金花虫", "はむし"],
["三白草", "はんげしょう"],
["青頭菌", "はつたけ"],
["紫荊", "はなずおう"],
["石長生", "はこねそう"]
);

DATA[26] = new Array(
["石松", "ひかげのかずら"],
["小舌", "ひこ"],
["漏蘆", "ひごたい"],
["赤栴檀", "ひめしゃら"],
["白英", "ひよどりじょうご"],
["山蘭", "ひよどりばな"],
["睡蓮", "ひつじぐさ"],
["石韋", "ひとつば"],
["山丹", "ひめゆり"],
["鼓子花", "ひるがお"],
["眼子菜", "ひるむしろ"]
);

DATA[27] = new Array(
["側金盞花", "ふくじゅそう"],
["白花菜", "ふうちょうそう"],
["蘭草", "ふじばかま"],
["恭菜", "ふだんそう"]
);

DATA[28] = new Array(
["巻子", "へそ"],
["牛皮凍", "へくそかずら"]
);

DATA[29] = new Array(
["山小菜", "ほたるぶくろ"],
["人面竹", "ほていちく"],
["塊芋", "ほど"],
["赤根草", "ほうせんか"],
["馬勃", "ほこりたけ"],
["燭夜", "ほたる"]
);

DATA[30] = new Array(
["射翳", "まぶし"],
["山蘿蔔", "まつむしそう"],
["斑杖", "まむしぐさ"],
["菴羅", "マンゴー"],
["虺", "まむし"]
);

DATA[31] = new Array(
["灯台木", "みずき"],
["浮薔", "みずあおい"],
["金線草", "みずひき"],
["野蜀葵", "みつば,みつばぜり"],
["省沽油", "みつばうつぎ"],
["黄瑞香", "みつまた"],
["睡菜", "みつがしわ"],
["金線草", "みずひき,みずひきそう"],
["六月菊", "みやまよめな"]
);

DATA[32] = new Array(
["野木瓜", "むべ"]
);

DATA[33] = new Array(
["益母草", "めはじき"],
["鉄掃箒", "めどはぎ"],
["榠櫨", "メイサ"]
);

DATA[34] = new Array(
["唐木香", "もっこう"],
["厚皮香", "もっこく"],
["妄榧", "もみ"],
["天竺鼠", "モルモット"],
["栴", "もみじ"],
["鴃", "もず"]
);

DATA[35] = new Array(
["窃衣", "やぶじらみ"],
["金剛纂", "やつで"],
["貫衆", "やぶそてつ"],
["四照花", "やまぼうし"],
["九面芋", "やつがしら"],
["鶏眼草", "やはずそう"],
["天名精", "やぶたばこ"],
["胡蝶樹", "やぶでまり"],
["商陸", "やまごぼう"],
["野山薬", "やまのいも"]
);

DATA[36] = new Array(
["珍珠花", "ゆきやなぎ"],
["鹿薬", "ゆきざさ"]
);

DATA[37] = new Array(
["蒿", "よもぎ"],
["娵菜", "よめな"]
);

DATA[38] = new Array(
["紫丁香花", "ライラック"],
["御僊花", "ライチ"]
);

DATA[39] = new Array(
["紫丁香花", "リラ"],
["蘋婆", "りんご"]
);

DATA[40] = new Array(
["拡大鏡", "ルーペ"],
["櫑茶", "るいざ"],
["瑠璃鶲", "るりびたき"],
["輪盤賭", "ルーレット"],
["坩堝", "るつぼ"]
);

DATA[41] = new Array(
["紫雲英", "れんげそう"],
["藜藋", "れいち"]
);

DATA[42] = new Array(
["臘梅", "ろうばい"],
["僂佝", "ろうく"],
["羅馬菊", "ロオマギク"],
["鹿苑草", "ろくおんそう"],
["菉豆", "ろくどう"],
["轆轤鉋", "ろくろがんな"]
);

DATA[43] = new Array(
["仙蓼", "われもこう"],
["鼠姑", "わらじむし"]
);

DATA[44] = new Array(
["腸線", "ガット"],
["金銀蓮花", "ががぶた"]
);

DATA[45] = new Array(
["紫萼", "ぎぼうし"],
["黄顙魚", "ぎぎ"],
["刻魚", "ぎざみ"],
["義須", "ぎす"],
["銀馬", "ぎま"]
);

DATA[46] = new Array(
);

DATA[47] = new Array(
["紫雲英", "げんげ"],
["砕米菜", "げんげ"],
["蚰衍", "げじげじ"],
["下足", "げそ,げそく"],
["挙固", "げんこ"],
["元禄鯛", "げんろくだい"]
);

DATA[48] = new Array(
["野鴉椿", "ごんずい"],
["玄参", "ごまのはぐさ"],
["埖", "ごみ"],
["檱", "ごいし,ご"],
["鶄", "ごいさぎ"]
);

DATA[49] = new Array(
["粟米草", "ざくろそう"],
["楉", "ざくろ"],
["篅", "ざる"]
);

DATA[50] = new Array(
["沿階草", "じゃのひげ"],
["瑞香", "じんちょうげ"],
["二度芋", "じゃがいも"],
["腰細蜂", "じがばち"]
);

DATA[51] = new Array(
["棠梨", "ずみ"],
["楉蟹", "ずわいがに"],
["螟", "ずいむし"]
);

DATA[52] = new Array(
["紫萁", "ぜんまい"],
["荍", "ぜにあおい"],
["鏹", "ぜに"]
);

DATA[53] = new Array(
);

DATA[54] = new Array(
["回青橙", "だいだい"],
["八脚子", "だに"],
["天竺牡丹", "ダリア"]
);

DATA[55] = new Array(
);

DATA[56] = new Array(
);

DATA[57] = new Array(
["胡", "でたらめ"],
["蝓", "でんでんむし"],
["疕", "できもの"],
["塑", "でく"]
);

DATA[58] = new Array(
["無食子", "どんぐり"],
["王不留行", "どうかんそう"]
);

DATA[59] = new Array(
["馬尾毛", "ばす"],
["螇蚸", "ばった"],
["鬽", "ばけもの"],
["飧", "ばんめし"]
);

DATA[60] = new Array(
["編木", "びんざさら"],
["金糸桃", "びようやなぎ"],
["壜麦酒", "ビンビール"]
);

DATA[61] = new Array(
);

DATA[62] = new Array(
["景天", "べんけいそう"]
);

DATA[63] = new Array(
["放春花", "ぼけ"]
);

DATA[64] = new Array(
["紅辣椒", "パプリカ"]
);

DATA[65] = new Array(
);

DATA[66] = new Array(
);

DATA[67] = new Array(
["北亰烤鴨", "ペキンダック"],
["薄荷酒", "ペパーミント"]
);

DATA[68] = new Array(
["白楊樹", "ポプラ"]
);

