
let TITLE = "漢字しりとり(仮) - レベル２";
let PAGE_TITLE = "漢字しりとり(仮) レベル２";
let BACKGROUND_URL = "../img/img_siritori.jpg";

let LEVEL = 2;
let NAME = "フブキ";
let ATTACK = 15;
let IMAGE_URL = "t.co/l4dUTmFulK";
let GENRE = "魚介類・海関連のもの";

let DATA = new Array();

DATA[0] = new Array(
["醤蝦", "あみ"],
["鮑", "あわび"],
["琵琶魚", "あんこう"],
["銀口魚", "あゆ"],
["海鰻", "あなご"],
["海驢", "あしか"],
["鯇", "あめのうお,あめ"],
["阿乙呉", "あいご"],
["相嘗魚", "あいなめ"],
["𩺊", "あら"],
["羊駱駝", "アルパカ"],
["鱫鱜", "あいきょう,あゆ"],
["雨虎", "あめふらし"]
);

DATA[1] = new Array(
["鮊子", "いかなご"],
["望潮魚", "いいだこ"],
["鶏魚", "いさき"],
["貽貝", "いがい"],
["鯆", "いるか"],
["鰮", "いわし"],
["墨魚", "いか"],
["竜蝦", "いせえび"],
["魦", "いさぎ"],
["鮇", "いわな"],
["東南風", "いなさ"],
["鯨", "いさな,いさ"],
["座魚", "いざりうお"],
["金糸魚", "いとよりだい,いとより"]
);

DATA[2] = new Array(
["霊螺子", "うに"],
["桃花魚", "うぐい"],
["鰾", "うきぶくろ,うおのふえ"],
["泉海魚", "うなぎ"],
["墨西哥鯢", "ウーパールーパー"],
["鱓", "うつぼ,うみへび"],
["鱔", "うみへび"]
);

DATA[3] = new Array(
["海鷂魚", "えい"],
["狗母魚", "えそ"],
["斉魚", "えつ"],
["魵", "えび"],
["鰓", "えら"]
);

DATA[4] = new Array(
["膃肭臍", "オットセイ"],
["海狗", "オットセイ"],
["鰲", "おおがめ,おおうみがめ,おおすっぽん"],
["追河", "おいかわ"],
["虎魚", "おこぜ"],
["鰧", "おこぜ"],
["鸚鵡貝", "おうむがい"]
);

DATA[5] = new Array(
["鰍", "かじか"],
["旗魚", "かじき"],
["火魚", "かながしら"],
["梭子魚", "かます"],
["川蜷", "かわにな"],
["魴", "かがみだい,かがみたい,かがみうお"],
["王余魚", "かれい"],
["硴", "かき"],
["杜父魚", "かじか,かくぶつ,かまきり"],
["鱟", "かぶとがに"],
["鯑", "かずのこ"],
["鱲", "からすみ"],
["鮍", "かわはぎ"],
["梅花皮", "かいらぎ"],
["松魚", "かつお"],
["鮋", "かさご"]
);

DATA[6] = new Array(
["鼠頭魚", "きす"],
["蚶", "きさ"],
["細螺", "きさご"],
["金海鼠", "きんこ"],
["黄鰭", "きはだ"],
["黍魚子", "きびなご"]
);

DATA[7] = new Array(
["鮓", "くらげ"],
["烏頬魚", "くろだい"]
);

DATA[8] = new Array(
["剣先烏賊", "けんさきいか"]
);

DATA[9] = new Array(
["鯒", "こち"],
["牛尾魚", "こち"],
["鮗", "このしろ"],
["鰶", "このしろ"],
["鯯", "このしろ"],
["鮣", "こばんざめ"],
["氷下魚", "こまい"],
["胡盧鯛", "ころだい"],
["小鰭", "こはだ"]
);

DATA[10] = new Array(
["馬鮫魚", "さわら"],
["青花魚", "さば"],
["十脚", "さくらえび"],
["蠆", "さそり"],
["鯢", "さんしょううお"],
["青箭魚", "さごし"],
["針嘴魚", "さより"],
["青串魚", "さんま"]
);

DATA[11] = new Array(
["青蝦", "しばえび"],
["青竜蝦", "しゃこ"],
["鯱", "しゃちほこ,しゃち"],
["鬼頭魚", "しいら"],
["犁頭魚", "しゅもくざめ"],
["望潮", "しおまねき"],
["鱠残魚", "しらうお"],
["鞋底魚", "したびらめ"],
["鮪", "しび"],
["四時美", "しじみ"]
);

DATA[12] = new Array(
["鱸", "すずき"],
["松江魚", "すずき"],
["助惣鱈", "すけそうだら"],
["鯳", "すけとうだら"],
["鯐", "すばしり"],
["鯣", "するめ"]
);

DATA[13] = new Array(
);

DATA[14] = new Array(
["曹以", "そい"],
["宗太鰹", "そうだがつお"],
["袖烏賊", "そでいか"]
);

DATA[15] = new Array(
["大口魚", "たら,たいこうぎょ"],
["白帯魚", "たちうお"],
["海馬", "たつのおとしご"],
["海燕", "たこのまくら"],
["鮉", "たい"],
["鰖", "たかべ"],
["鱮", "たなご"],
["章魚", "たこ"]
);

DATA[16] = new Array(
["鱅", "ちちかぶり"],
["知知武", "ちちぶ"],
["鱘", "ちょうざめ"],
["海鯽", "ちぬ"]
);

DATA[17] = new Array(
["鰢", "つくら"],
["燕魚", "つばめうお"],
["鮺", "つけうお"]
);

DATA[18] = new Array(
["天竺鯛", "てんじくだい"]
);

DATA[19] = new Array(
["魹", "とど"],
["小鮑", "とこぶし"],
["止比乎", "とびうお"]
);

DATA[20] = new Array(
["土肉", "なまこ"],
["土笋", "なまこ"],
["鱠", "なます"],
);

DATA[21] = new Array(
["鮸", "にべ"],
["鰾膠", "にべ"],
["虹鱒", "にじます"]
);

DATA[22] = new Array(
["饅鰻", "ぬたうなぎ"]
);

DATA[23] = new Array(
);

DATA[24] = new Array(
);

DATA[25] = new Array(
["雷魚", "はたはた"],
["鮠", "はや,はえ,はい"],
["鱧", "はも"],
["鰚", "はらか"],
["鰣", "はす"],
["魬", "はまち"],
["鮞", "はららご,はらご"]
);

DATA[26] = new Array(
["鰉", "ひがい"],
["海盤車", "ひとで"],
["比目魚", "ひらめ"],
["鯷", "ひしこ"],
["鰭", "ひれ"]
);

DATA[27] = new Array(
["鱶", "ふか"],
["鰾", "ふえ"],
["鮐", "ふぐ"],
["魨", "ふぐ"],
["鮒", "ふな"]
);

DATA[28] = new Array(
);

DATA[29] = new Array(
["竹麦魚", "ほうぼう"],
["老海鼠", "ほや"],
["梭尾螺", "ほらがい"],
["海扇", "ほたてがい"]
);

DATA[30] = new Array(
["蟶", "まて,まてがい"],
["円坊魚", "まんぼう"],
["金鎗魚", "まぐろ"],
["鱒", "ます"],
["鯧", "まながつお"],
["魴", "まとうだい,まとうお"]
);

DATA[31] = new Array(
["水蚤", "みじんこ"],
["水松貝", "みるがい"],
["蓑笠子", "みのかさご"],
["鼓豆虫", "みずすまし"],
["水蛸", "みずだこ"]
);

DATA[32] = new Array(
["鱫", "むつ"]
);

DATA[33] = new Array(
["赤目魚", "めなだ"],
["麦魚", "めだか"],
["丁斑魚", "めだか"],
["撮干魚", "めだか"],
["青鱂", "めだか"],
["𩻛", "めいただき"],
["眼撥", "めばち"]
);

DATA[34] = new Array(
["藻魚", "もうお,もいお"],
["諸子魚", "もろこ"]
);

DATA[35] = new Array(
["山女魚", "やまめ"],
["魚叉", "やす"],
["水蠆", "やご"]
);

DATA[36] = new Array(
["湯鯉", "ゆごい"]
);

DATA[37] = new Array(
["葦登", "よしのぼり"],
["瓔珞貝", "ようらくがい"]
);

DATA[38] = new Array(
["蘭鋳", "らんちゅう"],
["海獺", "らっこ"],
["雷魚", "らいぎょ"]
);

DATA[39] = new Array(
["龍宮之遣", "りゅうぐうのつかい"],
["陸前海豚", "りくぜんいるか"]
);

DATA[40] = new Array(
);

DATA[41] = new Array(
["連魚", "れんぎょ"]
);

DATA[42] = new Array(
["海蝲蛄", "ロブスター"],
["驢馬", "ろば"],
["浪人鰺", "ろうにんあじ"],
["蝋燭𩸽", "ろうそくぼっけ"],
["露西亜蛽", "ロシアバイ"]
);

DATA[43] = new Array(
["藁素坊", "わらすぼ"],
["鱷", "わに"],
["公魚", "わかさぎ"],
["草鯝魚", "わたか"],
["稚鰤", "わらさ"]
);

DATA[44] = new Array(
["蝤蛑", "がざみ"]
);

DATA[45] = new Array(
["黄顙魚", "ぎぎ"],
["剛腮魚", "ぎぎ"],
["刻魚", "ぎざみ"],
["義須", "ぎす"],
["銀馬", "ぎま"],
["義万", "ぎま"],
["剱頭", "ぎんざめ"]
);

DATA[46] = new Array(
);

DATA[47] = new Array(
["下足", "げそ,げそく"],
["玄華", "げんげ"],
["挙固", "げんこ"],
["元禄鯛", "げんろくだい"]
);

DATA[48] = new Array(
["権瑞", "ごんずい"],
["古女", "ごまめ"],
["巨頭鯨", "ごんどうくじら"],
["胡麻斑海豹", "ゴマフアザラシ"],
["沙蚕", "ごかい"],
["海黄顙魚", "ごんずい"],
["鮴", "ごり"]
);

DATA[49] = new Array(
);

DATA[50] = new Array(
["蛇目蝤蛑", "じゃのめがざみ"],
["甚兵衛鮫", "じんべえざめ"],
["甚平鮫", "じんべいざめ"]
);

DATA[51] = new Array(
["楚蟹", "ずわいがに"]
);

DATA[52] = new Array(
);

DATA[53] = new Array(
);

DATA[54] = new Array(
["大王烏賊", "だいおういか"],
["獺", "だつ"],
["啄長魚", "だつ"]
);

DATA[55] = new Array(
);

DATA[56] = new Array(
);

DATA[57] = new Array(
);

DATA[58] = new Array(
["溝貝", "どぶがい"],
["鯲", "どじょう"],
["鈍甲", "どんこ"]
);

DATA[59] = new Array(
["海蠃", "ばい"],
["破家蛤", "ばかがい"]
);

DATA[60] = new Array(
["魚籠", "びく"],
["鬢長鮪", "びんながまぐろ"]
);

DATA[61] = new Array(
["鰤", "ぶり"],
["大口黒鱒", "ブラックバス"],
["醜鯛", "ぶだい"]
);

DATA[62] = new Array(
["火烏賊", "ベカ"],
["倍良", "べら"]
);

DATA[63] = new Array(
["蛇頭魚", "ぼら"],
["牡丹蝦", "ぼたんえび"]
);

DATA[64] = new Array(
);

DATA[65] = new Array(
);

DATA[66] = new Array(
);

DATA[67] = new Array(
);

DATA[68] = new Array(
);

