
let TITLE = "漢字しりとり(仮) - レベル１";
let PAGE_TITLE = "漢字しりとり(仮) レベル１";
let BACKGROUND_URL = "../img/img_siritori.jpg";

let LEVEL = 1;
let NAME = "ポチ";
let ATTACK = 30;
let IMAGE_URL = "t.co/aCdMJx0yTh";
let GENRE = "食べ物・植物・小さいもの";

let DATA = new Array();

DATA[0] = new Array(
["間鴨", "あいがも"],
["氷菓子", "アイスクリーム"],
["扁桃", "アーモンド"],
["蟻", "あり"],
["粟", "あわ"],
["葵", "あおい"],
["青桐", "あおぎり"],
["紫陽花", "あじさい"],
["皸", "あかぎれ,あかがり"],
["藜", "あかざ"],
["畦道", "あぜみち"],
["茜", "あかね"],
["灰汁", "あく"],
["欠伸", "あくび"],
["胡坐", "あぐら"],
["鳳蝶", "あげはちょう,あげは"],
["通草", "あけび"],
["糸葱", "あさつき"],
["薊", "あざみ"],
["肋骨", "あばらぼね"],
["翌檜", "あすなろ"],
["土瀝青", "アスファルト"],
["馬酔木", "あせび,あしび"],
["家鴨", "あひる"],
["肋骨", "あばらぼね"],
["信天翁", "あほうどり"],
["水馬", "あめんぼ"],
["酒精", "アルコール"],
["霰", "あられ"],
["雨虎", "あめふらし"]
);

DATA[1] = new Array(
["烏賊", "いか"],
["石塊", "いしころ"],
["斑鳩", "いかる,いかるが"],
["交喙", "いすか"],
["磯巾着", "いそぎんちゃく"],
["鼬", "いたち"],
["無花果", "いちじく,いちじゅく"],
["公孫樹", "いちょう"],
["犬榧", "いぬがや"],
["犬蓼", "いぬたで"],
["鼾", "いびき"],
["豆娘", "いととんぼ"],
["煎海鼠", "いりこ"],
["巻柏", "いわひば"],
["音呼", "いんこ"]
);

DATA[2] = new Array(
["茴香", "ういきょう"],
["火酒", "ウォッカ,ウイスキー"],
["嗽", "うがい"],
["鶯", "うぐいす"],
["鶉", "うずら"],
["鷽", "うそ"],
["烏骨鶏", "うこっけい"],
["転寝", "うたたね"],
["兎", "うさぎ,う"],
["優曇華", "うどんげ"],
["項", "うなじ"],
["海栗", "うに"],
["鰻", "うなぎ"],
["浮塵子", "うんか"],
["独活", "うど"]
);

DATA[3] = new Array(
["笑窪", "えくぼ"],
["金雀枝", "エニシダ"],
["榎", "えのき"],
["狗尾草", "えのころぐさ"],
["海老", "えび"],
["荏胡麻", "えごま"],
["豌豆", "えんどう"]
);

DATA[4] = new Array(
["鸚鵡", "おうむ"],
["麋", "おおじか"],
["雪花菜", "おから"],
["万年青", "おもと"],
["鳳", "おおとり"],
["車前草", "おおばこ"],
["極光", "オーロラ"],
["朮", "おけら"],
["歩行虫", "おさむし"],
["鴛鴦", "おしどり,おし"],
["荻", "おぎ"],
["巻耳", "おなもみ"],
["馬大頭", "おにやんま"],
["阿利布", "オリーブ"],
["自鳴琴", "オルゴール"],
["御玉杓子", "おたまじゃくし"],
["陥穽", "おとしあな"]
);

DATA[5] = new Array(
["腕", "かいな"],
["楓", "かえで"],
["踵", "かかと"],
["牡蠣", "かき"],
["歌留多", "カルタ"],
["花椰菜", "カリフラワー"],
["杜若", "かきつばた"],
["混合酒", "カクテル"],
["蜉蝣", "かげろう"],
["樫", "かし"],
["卵糖", "カステラ"],
["案山子", "かかし"],
["天牛", "かみきりむし,かみきり"],
["霞", "かすみ,か"],
["加加阿", "カカオ"],
["蒲鉾", "かまぼこ"],
["甲虫", "かぶとむし"],
["上下", "かみしも,かるめる"],
["蚕", "かいこ"],
["蝸牛", "かたつむり,かぎゅう"],
["酢漿草", "かたばみ"],
["金糸雀", "カナリア"],
["蟷螂", "かまきり"],
["蛙", "かえる,かわず"],
["柏", "かしわ"],
["桂", "かつら"],
["蕪", "かぶ,かぶら"],
["鴨", "かも"],
["鴎", "かもめ"],
["落葉松", "からまつ"]
);

DATA[6] = new Array(
["木耳", "きくらげ"],
["雉子", "きじ,きぎす,きぎし"],
["煙管", "キセル"],
["啄木鳥", "きつつき"],
["黄粉", "きなこ"],
["茸", "きのこ"],
["黍団子", "きびだんご"],
["肌理", "きめ,きり"],
["胡瓜", "きゅうり,きうり"],
["螽斯", "きりぎりす"],
["金木犀", "きんもくせい"],
["沈菜", "キムチ"]
);

DATA[7] = new Array(
["水鶏", "くいな"],
["嚔", "くしゃみ,くさめ"],
["楠", "くす,くすのき"],
["山梔子", "くちなし"],
["蜘蛛", "くも"],
["轡虫", "くつわむし"],
["椚", "くぬぎ"],
["海月", "くらげ"],
["凝乳", "クリーム"],
["鍬形", "くわがた"],
["踝", "くるぶし"]
);

DATA[8] = new Array(
["芥子", "けし"],
["華鬘草", "けまんそう"],
["欅", "けやき"],
["螻蛄", "けら"],
["巻繊汁", "けんちんじる"]
);

DATA[9] = new Array(
["鸛", "こうのとり"],
["首", "こうべ"],
["蝙蝠", "こうもり"],
["蟋蟀", "こおろぎ"],
["金亀子", "こがねむし"],
["苔", "こけ"],
["秋桜", "コスモス"],
["鏝", "こて"],
["洋杯", "コップ"],
["炬燵", "こたつ"],
["珈琲", "コーヒー"],
["辛夷", "こぶし"],
["混凝土", "コンクリート"],
["蒟蒻", "こんにゃく"],
["胡椒", "こしょう"],
["円規", "コンパス"],
["木栓", "コルク"],
["燻牛肉", "コンビーフ"],
["東風", "こち"]
);

DATA[10] = new Array(
["賽子", "さいころ,さい"],
["栄螺", "さざえ"],
["薩摩芋", "さつまいも"],
["甘蔗", "さとうきび"],
["蛹", "さなぎ"],
["条虫", "さなだむし"],
["百日紅", "さるすべり"],
["細波", "さざなみ"],
["秋刀魚", "さんま"],
["蠍", "さそり"],
["鷺", "さぎ"],
["山茶花", "さざんか"],
["珊瑚", "さんご"]
);

DATA[11] = new Array(
["香蕈", "しいたけ"],
["鴫", "しぎ"],
["樒", "しきみ"],
["蜆", "しじみ"],
["占地", "しめじ"],
["柳葉魚", "ししゃも"],
["紫蘇", "しそ"],
["四十雀", "しじゅうから"],
["羊歯", "しだ"],
["衣魚", "しみ"],
["石楠花", "しゃくなげ"],
["蝦蛄", "しゃこ"],
["襯衣", "シャツ,しんい"],
["吃逆", "しゃっくり,しゃくり"],
["軍鶏", "しゃも"],
["精霊蝗", "しょうりょうばった"],
["虱", "しらみ,しつ"],
["雫", "しずく"],
["菖蒲", "しょうぶ"]
);

DATA[12] = new Array(
["西瓜", "すいか"],
["酸模", "すかんぽ"],
["粗描", "スケッチ"],
["菫", "すみれ"],
["清白", "すずしろ"],
["菘", "すずな"],
["双陸", "すごろく"],
["鋤", "すき"],
["胡蜂", "すずめばち"],
["簾", "すだれ"],
["掏摸", "すり"],
["李", "すもも"]
);

DATA[13] = new Array(
["鶺鴒", "せきれい"],
["蝉時雨", "せみしぐれ"],
["芹", "せり"],
["千振茶", "せんぶりちゃ"]
);

DATA[14] = new Array(
["曹達", "ソーダ"],
["雀斑", "そばかす"],
["蚕豆", "そらまめ"],
["蕎麦", "そば"]
);

DATA[15] = new Array(
["笋", "たけのこ,たこうな"],
["橘", "たちばな"],
["束子", "たわし"],
["蓼", "たで"],
["鬣", "たてがみ"],
["掌", "たなごころ"],
["田螺", "たにし"],
["煙草", "たばこ"],
["箪笥", "たんす"],
["蒲公英", "たんぽぽ"],
["黄昏", "たそがれ"]
);

DATA[16] = new Array(
["乾酪", "チーズ"],
["鵆", "ちどり"],
["哨吶", "チャルメラ"],
["鬱金香", "チューリップ"],
["貯古齢糖", "チョコレート"],
["青梗菜", "ちんげんさい"]
);

DATA[17] = new Array(
["栂", "つが"],
["土筆", "つくし,つくしんぼ"],
["鶫", "つぐみ"],
["柘植", "つげ"],
["蔓", "つる"],
["恙虫", "つつがむし"],
["躑躅", "つつじ"],
["椿", "つばき"],
["蔦", "つた"],
["爪楊枝", "つまようじ"],
["旋毛", "つむじ,つむじげ,つじ"],
["旋風", "つむじかぜ,つむじ,つじかぜ"]
);

DATA[18] = new Array(
["卓子", "テーブル"],
["梃子", "てこ"],
["庭球", "テニス"],
["紅娘", "てんとうむし"]
);

DATA[19] = new Array(
["蕃椒", "とうがらし"],
["蜥蜴", "とかげ"],
["朱鷺", "とき"],
["木賊", "とくさ"],
["橡", "とち,とちのき"],
["椴松", "とどまつ"],
["馴鹿", "トナカイ"],
["蕃茄", "トマト"],
["薯蕷芋", "とろろいも"],
["隧道", "トンネル"],
["蜻蛉", "とんぼ"],
["玉蜀黍", "とうもろこし"]
);

DATA[20] = new Array(
["長薯", "ながいも"],
["凪", "なぎ"],
["棗", "なつめ"],
["汀", "なぎさ"],
["滑子", "なめこ"],
["撫子", "なでしこ"],
["樹懶", "なまけもの"],
["蛞蝓", "なめくじ"],
["弱竹", "なよたけ"],
["楢", "なら"],
["海鼠", "なまこ"],
["茄子", "なす,なすび"]
);

DATA[21] = new Array(
["鳰", "にお"],
["面皰", "にきび"],
["仮漆", "ニス"],
["洋銀", "ニッケル"],
["肉桂", "にっけい,にっき"],
["膠", "にかわ"],
["韮", "にら"],
["接骨木", "にわとこ,にわとこぎ"],
["大蒜", "にんにく"]
);

DATA[22] = new Array(
["鵺", "ぬえ"],
["泥濘", "ぬかるみ"],
["微温湯", "ぬるまゆ"],
["滑滑", "ぬめぬめ"]
);

DATA[23] = new Array(
["葱", "ねぎ"],
["螺子", "ネジ"],
["杜松", "ねず"],
["鼠", "ねずみ"],
["合歓", "ねむ,ねぶ,ねむのき,ねぶのき"],
["猫糞", "ねこばば"]
);

DATA[24] = new Array(
["凌霄花", "のうぜんかずら,のうぜんか,のうぜん"],
["芒", "のぎ"],
["蚤", "のみ"],
["熨斗", "のし"],
["鋸", "のこぎり"],
["狼煙", "のろし"],
["海苔", "のり"]
);

DATA[25] = new Array(
["口風琴", "ハーモニカ"],
["繁縷", "はこべ,はこべら"],
["鋏", "はさみ"],
["梯子", "はしご"],
["疾風", "はやて"],
["洟", "はな,はなじる"],
["蓮", "はす,はちす"],
["鰰", "はたはた"],
["花弁", "はなびら"],
["隼", "はやぶさ"],
["蠅", "はえ,はい"],
["波布", "はぶ"],
["蛤", "はまぐり,はま"],
["手巾", "ハンカチ"],
["送球", "ハンドボール"],
["南風", "はえ"]
);

DATA[26] = new Array(
["抽斗", "ひきだし"],
["羆", "ひぐま,ひ"],
["鹿尾菜", "ひじき"],
["蜩", "ひぐらし"],
["雹", "ひょう"],
["檜", "ひのき,ひ"],
["雲雀", "ひばり"],
["庇", "ひさし"],
["蟇", "ひきがえる,ひき"],
["髭", "ひげ"],
["蛭", "ひる"],
["午睡", "ひるね"],
["蹄", "ひづめ"],
["向日葵", "ひまわり,ひゅうがあおい"]
);

DATA[27] = new Array(
["蕗", "ふき"],
["河豚", "ふぐ"],
["梟", "ふくろう"],
["紅鶴", "フラミンゴ"],
["頭垢", "ふけ"],
["麩", "ふ,ふすま"]
);

DATA[28] = new Array(
["糸瓜", "へちま"],
["臍", "へそ"],
["箆", "へら"]
);

DATA[29] = new Array(
["箒", "ほうき"],
["鬼灯", "ほおずき"],
["黒子", "ほくろ"],
["矛", "ほこ"],
["頬", "ほお,ほほ"],
["時鳥", "ほととぎす"],
["畔", "ほとり"],
["熱", "ほとぼり"],
["法螺貝", "ほらがい"],
["埃", "ほこり"]
);

DATA[30] = new Array(
["蝸牛被", "まいまいかぶり"],
["鉞", "まさかり"],
["馬刀貝", "まてがい"],
["睫毛", "まつげ"],
["燐寸", "マッチ"],
["松陰嚢", "まつぼっくり,まつふぐり"],
["瞼", "まぶた"],
["肉刺", "まめ"],
["毬藻", "まりも"],
["蝮", "まむし"],
["檬果", "マンゴー"],
["俎板", "まないた"]
);

DATA[31] = new Array(
["鶚", "みさご"],
["微塵子", "みじんこ"],
["雨久花", "みずあおい"],
["蚯蚓", "みみず"],
["蓑虫", "みのむし"],
["鳩尾", "みぞおち,みずおち"],
["霙", "みぞれ"],
["茗荷", "みょうが"],
["角鴟", "みみずく"],
["耳朶", "みみたぶ"],
["蹼", "みずかき"]
);

DATA[32] = new Array(
["零余子", "むかご"],
["百足", "むかで"],
["毳", "むくげ"],
["骸", "むくろ"],
["椋鳥", "むくどり"],
["貉", "むじな"],
["鼯鼠", "むささび"]
);

DATA[33] = new Array(
["鍍金", "メッキ"],
["雌蕊", "めしべ"],
["和布蕪", "めかぶ"],
["目脂", "めやに"],
["麵媽", "メンマ"],
["目眩", "めまい"]
);

DATA[34] = new Array(
["艾", "もぐさ"],
["土竜", "もぐら,もぐらもち"],
["百舌", "もず"],
["水雲", "もずく"],
["籾", "もみ"],
["椛", "もみじ"],
["靄", "もや"],
["最中", "もなか"]
);

DATA[35] = new Array(
["八重葎", "やえむぐら"],
["山羊", "やぎ"],
["馬陸", "やすで"],
["豺", "やまいぬ"],
["谺", "やまびこ"],
["槍", "やり"],
["椰子", "やし"],
["寄居虫", "やどかり"],
["豪猪", "やまあらし"],
["赤楝蛇", "やまかがし"],
["冬眠鼠", "やまね"]
);

DATA[36] = new Array(
["柚子", "ゆず"],
["山桜桃", "ゆすらうめ"],
["交譲葉", "ゆずりは"],
["百合", "ゆり"],
["湯湯婆", "ゆたんぽ"]
);

DATA[37] = new Array(
["葦切", "よしきり"],
["夜鷹", "よたか"],
["涎", "よだれ"],
["蓬", "よもぎ"]
);

DATA[38] = new Array(
["豚脂", "ラード"],
["駱駝", "らくだ"],
["辣韮", "らっきょう"],
["喇叭", "ラッパ"],
["騾馬", "らば"],
["闘球", "ラグビー"],
["覇王花", "ラフレシア"]
);

DATA[39] = new Array(
["小酒", "リキュール"],
["栗鼠", "リス"],
["苹果", "りんご"],
["竜胆", "りんどう"]
);

DATA[40] = new Array(
["坩堝", "るつぼ"],
["瑠璃", "るり"],
["輪盤賭", "ルーレット"],
["紅玉", "ルビー"]
);

DATA[41] = new Array(
["小熊猫", "レッサーパンダ"],
["連翹", "れんぎょう"],
["蓮華", "れんげ"],
["煉瓦", "れんが"]
);

DATA[42] = new Array(
["轆轤", "ろくろ"],
["驢馬", "ろば"],
["臘梅", "ろうばい"],
["蝋燭", "ろうそく"]
);

DATA[43] = new Array(
["稚海藻", "わかめ"],
["山葵", "わさび"],
["草鞋", "わらじ"],
["藁", "わら"],
["鰐", "わに"],
["蕨", "わらび"],
["吾亦紅", "われもこう"],
["勿忘草", "わすれなぐさ"],
["鷲", "わし"]
);

DATA[44] = new Array(
["大蚊", "ががんぼ"],
["硝子", "ガラス"],
["蝦蟇", "がま,がまがえる"],
["瓦礫", "がれき"],
["響尾蛇", "がらがらへび"],
["雁擬き", "がんもどき"]
);

DATA[45] = new Array(
["限々", "ぎりぎり"],
["刻々", "ぎざぎざ"],
["擬宝珠", "ぎぼし,ぎぼうし,ぎぼうしゅ"],
["餃子", "ギョーザ,ギョウザ"],
["蟯虫", "ぎょうちゅう"]
);

DATA[46] = new Array(
["茱萸", "ぐみ"],
["葡萄柚", "グレープフルーツ"],
["青豌豆", "グリーンピース"]
);

DATA[47] = new Array(
["蚰蜒", "げじげじ,げじ"],
["紫雲英", "げんげ"],
["源五郎", "げんごろう"]
);

DATA[48] = new Array(
["胡麻", "ごま"],
["沙蚕", "ごかい"],
["塵箱", "ごみばこ"],
["護謨", "ゴム"]
);

DATA[49] = new Array(
["石榴", "ざくろ"],
["笊", "ざる"],
["蝲蛄", "ざりがに"],
["搾菜", "ザーサイ"]
);

DATA[50] = new Array(
["自然薯", "じねんじょ"],
["麝香鹿", "じゃこうじか"],
["蓴菜", "じゅんさい"],
["如雨露", "じょうろ"],
["沈丁花", "じんちょうげ"],
["絡新婦", "じょろうぐも"]
);

DATA[51] = new Array(
["木菟", "ずく"]
);

DATA[52] = new Array(
["薇", "ぜんまい"],
["発条", "ぜんまい"]
);

DATA[53] = new Array(
["草履", "ぞうり"]
);

DATA[54] = new Array(
["橙", "だいだい"],
["壁蝨", "だに"],
["金剛石", "ダイヤモンド,ダイアモンド"],
["達磨", "だるま"]
);

DATA[55] = new Array(
);

DATA[56] = new Array(
);

DATA[57] = new Array(
["梯姑", "でいご"],
["蝸牛", "でんでんむし"]
);

DATA[58] = new Array(
["満天星", "どうだんつつじ,どうだん"],
["溝", "どぶ"],
["避球", "ドッジボール"]
);

DATA[59] = new Array(
["貘", "ばく"],
["馬穴", "バケツ"],
["牛酪", "バター"],
["薔薇", "ばら"],
["甘蕉", "バナナ"],
["馬鈴薯", "ばれいしょ"]
);

DATA[60] = new Array(
["天鵞絨", "ビロード"],
["乾蒸餅", "ビスケット"],
["吃驚", "びっくり"],
["麦酒", "ビール"]
);

DATA[61] = new Array(
["山毛欅", "ぶな"],
["鞦韆", "ブランコ"],
["刷毛", "ブラシ"],
["錻力", "ブリキ"],
["葡萄", "ぶどう"]
);

DATA[62] = new Array(
["遍羅", "べら"],
["貝独楽", "べいごま,べーごま"]
);

DATA[63] = new Array(
["孑孑", "ぼうふら"],
["短艇", "ボート"],
["木瓜", "ぼけ"],
["雪洞", "ぼんぼり"],
["十柱戯", "ボウリング,ボーリング"]
);

DATA[64] = new Array(
["大熊猫", "パンダ"],
["鳳梨", "パイナップル"],
["万寿果", "パパイア,パパイヤ"],
["和蘭芹", "パセリ"]
);

DATA[65] = new Array(
["洋琴", "ピアノ"],
["鉄嘴", "ピンセット"]
);

DATA[66] = new Array(
["普洱茶", "プーアルちゃ"]
);

DATA[67] = new Array(
["油漆", "ペンキ,ペイント"],
["頁", "ページ"]
);

DATA[68] = new Array(
["木履", "ぽっくり"]
);

